#ifndef __BUZZER_H
#define __BUZZER_H

#include "stm32f10x.h"
#include "sys.h"

void Buzzer_Init(void);
/*****************************************************************************
 函数名    :Buzzer_Config
 功能描述  :蜂鸣器控制
 
 输入参数  :mode		 运行模式：可设置的值为1、0分别表示叫、不叫
            
           
 返回值    :无
------------------------------------------------------------------------------
 日	  期   : 2018年01月10日
 作	  者   : zcg
*****************************************************************************/
void Buzzer_Config(uint16_t mode);

#endif	/* __BUZZER_H */

